# !/usr/bin/python

import numpy as np

matrix2 = [[0.210225954, -0.279697205, -0.843553391],
            [0.326060953, -0.258482916, -0.172039093],
            [0.333044549, -0.205849197, 0.093385284],
            [0.331042528, -0.186535907, 0.138202519],
            [0.325120232, -0.155259605, 0.167586294],
            [0.32072369, -0.137133522,	0.162504878],
            [0.319981414, -0.111613075, 0.172975793],
            [0.281184027, 0.069811167, 0.165697608],
            [0.244218596, 0.197154871, 0.096361943],
            [0.221970325, 0.268319231, 0.023845456],
            [0.192948445, 0.374680519, -0.112775953],
            [0.169397552, 0.431508208, -0.216636966],
            [0.170267607, 0.432269305, -0.210722497],
            [0.18743752, 0.305348103, 0.072263159]]
matrix2 = np.matrix(matrix2)
sourceData = np.genfromtxt('./Project/PCAOnBonds/中国国债/中国国债历年信息汇总/国债数据.csv',delimiter=',',skip_header=False)
sourceData = np.matrix(sourceData)
processedData = sourceData * matrix2
np.savetxt('./Project/PCAOnBonds/中国国债/中国国债历年信息汇总/降维后数据.csv', processedData.tolist(), delimiter = ',')
print(processedData.tolist())